app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "render article"], ["description", "Welcome to using partials"], ["created_at", "2020-11-21 12:01:14.306491"], ["updated_at", "2020-11-21 12:01:14.306491"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "first article"], ["description", "This is the description edited"], ["updated_at", "2020-11-21 11:36:30.250534"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)